In [19]:
import pandas as pd

staff_df = pd.DataFrame([{'Name':'Kelly', 'Role':'HR'},
                         {'Name':'Sally', 'Role':'Editor'},
                         {'Name':'James', 'Role':'Grader'}])
staff_df.set_index('Name', inplace=True)
staff_df

         Role
Name
Kelly      HR
Sally  Editor
James  Grader

In [20]:
student_df = pd.DataFrame([{'Name':'James', 'School':'BA'},
                           {'Name':'Sally', 'School':'Engineering'},
                           {'Name':'Mike', 'School':'LLB'}])
student_df.set_index('Name', inplace=True)
student_df

            School
Name
James           BA
Sally  Engineering
Mike           LLB

In [9]:
pd.merge(staff_df, student_df, how='outer', 
         left_index=True, right_index=True)

         Role       School
Name
James  Grader           BA
Kelly      HR          NaN
Mike      NaN          LLB
Sally  Editor  Engineering

In [10]:
pd.merge(staff_df, student_df, how='inner', 
         left_index=True, right_index=True)

         Role       School
Name
Sally  Editor  Engineering
James  Grader           BA

In [11]:
pd.merge(staff_df, student_df, how='left', 
         left_index=True, right_index=True)

         Role       School
Name
Kelly      HR          NaN
Sally  Editor  Engineering
James  Grader           BA

In [12]:
pd.merge(staff_df, student_df, how='right', 
         left_index=True, right_index=True)

         Role       School
Name
James  Grader           BA
Sally  Editor  Engineering
Mike      NaN          LLB

In [21]:
staff_df = staff_df.reset_index()
staff_df

    Name    Role
0  Kelly      HR
1  Sally  Editor
2  James  Grader

In [22]:
student_df = student_df.reset_index()
student_df

    Name       School
0  James           BA
1  Sally  Engineering
2   Mike          LLB

In [23]:
pd.merge(staff_df,student_df,how='right',on='Name')

    Name    Role       School
0  James  Grader           BA
1  Sally  Editor  Engineering
2   Mike     NaN          LLB

In [24]:
staff_df = pd.DataFrame([{'Name':'Kelly', 'Role':'HR', 'Location':'ABC'},
                         {'Name':'Sally', 'Role':'Editor', 'Location':'DEF'},
                         {'Name':'James', 'Role':'Grader', 'Location':'GHI'}])
staff_df

    Name    Role Location
0  Kelly      HR      ABC
1  Sally  Editor      DEF
2  James  Grader      GHI

In [25]:
student_df = pd.DataFrame([{'Name':'James', 'School':'BA', 'Location':'JKL'},
                           {'Name':'Sally', 'School':'Engineering', 
                            'Location':'MNO'},
                           {'Name':'Mike', 'School':'LLB', 'Location':'PQR'}])
student_df

    Name       School Location
0  James           BA      JKL
1  Sally  Engineering      MNO
2   Mike          LLB      PQR

In [27]:
pd.merge(staff_df, student_df, on='Name', how='left')

    Name    Role Location_x       School Location_y
0  Kelly      HR        ABC          NaN        NaN
1  Sally  Editor        DEF  Engineering        MNO
2  James  Grader        GHI           BA        JKL

In [28]:
staff_df = pd.DataFrame([{'First Name': 'Kelly', 'Last Name': 'Desjardins', 
                          'Role': 'Director of HR'},
                         {'First Name': 'Sally', 'Last Name': 'Brooks', 
                          'Role': 'Course liasion'},
                         {'First Name': 'James', 'Last Name': 'Wilde', 
                          'Role': 'Grader'}])
staff_df

  First Name   Last Name            Role
0      Kelly  Desjardins  Director of HR
1      Sally      Brooks  Course liasion
2      James       Wilde          Grader

In [29]:
student_df = pd.DataFrame([{'First Name': 'James', 'Last Name': 'Hammond', 
                            'School': 'Business'},
                           {'First Name': 'Mike', 'Last Name': 'Smith', 
                            'School': 'Law'},
                           {'First Name': 'Sally', 'Last Name': 'Brooks', 
                            'School': 'Engineering'}])
student_df

  First Name Last Name       School
0      James   Hammond     Business
1       Mike     Smith          Law
2      Sally    Brooks  Engineering

In [32]:
pd.merge(staff_df, student_df, on=['First Name','Last Name'], how='inner')

  First Name Last Name            Role       School
0      Sally    Brooks  Course liasion  Engineering

In [36]:
staff_df = pd.DataFrame([{'Name':'Kelly', 'Role':'HR'},
                         {'Name':'Sally', 'Role':'Editor'},
                         {'Name':'James', 'Role':'Grader'}])
staff_df

    Name    Role
0  Kelly      HR
1  Sally  Editor
2  James  Grader

In [37]:
student_df = pd.DataFrame([{'Name':'Mike', 'Role':'Student1'},
                           {'Name':'Jack', 'Role':'Student2'},
                           {'Name':'Sam', 'Role':'Student3'}])
student_df

   Name      Role
0  Mike  Student1
1  Jack  Student2
2   Sam  Student3

In [38]:
pd.concat([staff_df, student_df])

    Name      Role
0  Kelly        HR
1  Sally    Editor
2  James    Grader
0   Mike  Student1
1   Jack  Student2
2    Sam  Student3

In [39]:
pd.concat([staff_df, student_df], keys=['staff', 'student'])

            Name      Role
staff   0  Kelly        HR
        1  Sally    Editor
        2  James    Grader
student 0   Mike  Student1
        1   Jack  Student2
        2    Sam  Student3

We can concat columns also but in that case index should match -

In [44]:
staff_df = pd.DataFrame([{'Name':'Kelly', 'Role':'HR'},
                         {'Name':'Sally', 'Role':'Editor'},
                         {'Name':'James', 'Role':'Grader'}])
staff_df.set_index('Name', inplace=True)
staff_df

         Role
Name
Kelly      HR
Sally  Editor
James  Grader

In [45]:
student_df = pd.DataFrame([{'Name':'James', 'School':'BA'},
                           {'Name':'Sally', 'School':'Engineering'},
                           {'Name':'Kelly', 'School':'LLB'}])
student_df.set_index('Name', inplace=True)
student_df

            School
Name
James           BA
Sally  Engineering
Kelly          LLB

In [46]:
pd.concat([staff_df, student_df], axis=1)

         Role       School
Kelly      HR          LLB
Sally  Editor  Engineering
James  Grader           BA